OpenNuvoton/NuMicroPy/M55M1/hal/M55M1_SPI.c
/**************************************************************************//**
 * @file     M55M1_SPI.c
 * @version  V0.01
 * @brief    M55M1 series SPI HAL source file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2025 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/

#include "py/mphal.h"

#include "NuMicro.h"
#include "nu_modutil.h"
#include "nu_bitutil.h"
#include "nu_miscutil.h"

#include "M55M1_SPI.h"

#define DEVICE_SPI_ASYNCH (1)
#define DEVICE_SPISLAVE (1)

extern void SPI0_IRQHandler(void);
extern void SPI1_IRQHandler(void);
extern void SPI2_IRQHandler(void);
extern void SPI3_IRQHandler(void);
extern void LPSPI0_IRQHandler(void);

struct nu_spi_var {
    spi_t *     obj;
    void        (*vec)(void);
#if DEVICE_SPI_ASYNCH
    uint8_t     pdma_perp_tx;
    uint8_t     pdma_perp_rx;
#endif
};

static struct nu_spi_var spi0_var = {
    .obj                =   NULL,
    .vec                =   SPI0_IRQHandler,
#if DEVICE_SPI_ASYNCH
    .pdma_perp_tx       =   PDMA_SPI0_TX,
    .pdma_perp_rx       =   PDMA_SPI0_RX
#endif
};
static struct nu_spi_var spi1_var = {
    .obj                =   NULL,
    .vec                =   SPI1_IRQHandler,
#if DEVICE_SPI_ASYNCH
    .pdma_perp_tx       =   PDMA_SPI1_TX,
    .pdma_perp_rx       =   PDMA_SPI1_RX
#endif
};
static struct nu_spi_var spi2_var = {
    .obj                =   NULL,
    .vec                =   SPI2_IRQHandler,
#if DEVICE_SPI_ASYNCH
    .pdma_perp_tx       =   PDMA_SPI2_TX,
    .pdma_perp_rx       =   PDMA_SPI2_RX
#endif
};
static struct nu_spi_var spi3_var = {
    .obj                =   NULL,
    .vec                =   SPI3_IRQHandler,
#if DEVICE_SPI_ASYNCH
    .pdma_perp_tx       =   PDMA_SPI3_TX,
    .pdma_perp_rx       =   PDMA_SPI3_RX
#endif
};
static struct nu_spi_var spi4_var = {
    .obj                =   NULL,
    .vec                =   LPSPI0_IRQHandler,
#if DEVICE_SPI_ASYNCH
    .pdma_perp_tx       =   LPPDMA_LPSPI0_TX,
    .pdma_perp_rx       =   LPPDMA_LPSPI0_RX
#endif
};

static const struct nu_modinit_s spi_modinit_tab[] = {
    {(uint32_t)SPI0, SPI0_MODULE, CLK_SPISEL_SPI0SEL_PCLK0, MODULE_NoMsk, SYS_SPI0RST, SPI0_IRQn, &spi0_var},
    {(uint32_t)SPI1, SPI1_MODULE, CLK_SPISEL_SPI1SEL_PCLK2, MODULE_NoMsk, SYS_SPI1RST, SPI1_IRQn, &spi1_var},
    {(uint32_t)SPI2, SPI2_MODULE, CLK_SPISEL_SPI2SEL_PCLK0, MODULE_NoMsk, SYS_SPI2RST, SPI2_IRQn, &spi2_var},
    {(uint32_t)SPI3, SPI3_MODULE, CLK_SPISEL_SPI3SEL_PCLK2, MODULE_NoMsk, SYS_SPI3RST, SPI3_IRQn, &spi3_var},
    {(uint32_t)LPSPI0, LPSPI0_MODULE, CLK_LPSPISEL_LPSPI0SEL_PCLK4, MODULE_NoMsk, SYS_LPSPI0RST, LPSPI0_IRQn, &spi4_var},

    {0, 0, 0, 0, 0, (IRQn_Type) 0, NULL}
};


/* Synchronous version of SPI_ENABLE()/SPI_DISABLE() macros
 *
 * The SPI peripheral clock is asynchronous with the system clock. In order to make sure the SPI
 * control logic is enabled/disabled, this bit indicates the real status of SPI controller.
 *
 * NOTE: All configurations shall be ready before calling SPI_ENABLE_SYNC().
 * NOTE: Before changing the configurations of SPIx_CTL, SPIx_CLKDIV, SPIx_SSCTL and SPIx_FIFOCTL registers,
 *       user shall clear the SPIEN (SPIx_CTL[0]) and confirm the SPIENSTS (SPIx_STATUS[15]) is 0
 *       (by SPI_DISABLE_SYNC here).
 */
__STATIC_INLINE void SPI_ENABLE_SYNC(SPI_T *spi_base)
{
    if (! (spi_base->CTL & SPI_CTL_SPIEN_Msk)) {
        SPI_ENABLE(spi_base);
    }
    while (! (spi_base->STATUS & SPI_STATUS_SPIENSTS_Msk));
}
__STATIC_INLINE void SPI_DISABLE_SYNC(SPI_T *spi_base)
{
    if (spi_base->CTL & SPI_CTL_SPIEN_Msk) {
        // NOTE: SPI H/W may get out of state without the busy check.
        while (SPI_IS_BUSY(spi_base)) {
            MICROPY_THREAD_YIELD();
        }

        SPI_DISABLE(spi_base);
    }
    while (spi_base->STATUS & SPI_STATUS_SPIENSTS_Msk);
}

__STATIC_INLINE void LPSPI_ENABLE_SYNC(LPSPI_T *lpspi_base)
{
    if (! (lpspi_base->CTL & LPSPI_CTL_SPIEN_Msk)) {
        SPI_ENABLE(lpspi_base);
    }
    while (! (lpspi_base->STATUS & LPSPI_STATUS_SPIENSTS_Msk));
}
__STATIC_INLINE void LPSPI_DISABLE_SYNC(LPSPI_T *lpspi_base)
{
    if (lpspi_base->CTL & LPSPI_CTL_SPIEN_Msk) {
        // NOTE: SPI H/W may get out of state without the busy check.
        while (LPSPI_IS_BUSY(lpspi_base)) {
            MICROPY_THREAD_YIELD();
        }

        LPSPI_DISABLE(lpspi_base);
    }
    while (lpspi_base->STATUS & LPSPI_STATUS_SPIENSTS_Msk);
}

static void spi_format(SPI_T *spi_base, int bits, int mode, int slave, int msb_first, int direction)
{

    SPI_DISABLE_SYNC(spi_base);

//	printf("bits: %d \n", bits);
//	printf("mode: %d \n", mode);
//	printf("slave: %d \n", slave);
//	printf("msb_first: %d \n", msb_first);
//	printf("direction: %d \n", direction);

    SPI_Open(spi_base,
             slave,
             (mode == 0) ? SPI_MODE_0 : (mode == 1) ? SPI_MODE_1 : (mode == 2) ? SPI_MODE_2 : SPI_MODE_3,
             bits,
             0);


    if(msb_first == SPI_FIRSTBIT_MSB)
        SPI_SET_MSB_FIRST(spi_base);
    else
        SPI_SET_LSB_FIRST(spi_base);


    if (slave == SPI_MASTER) {
        // Master
        // Configure SS as low active.
        SPI_EnableAutoSS(spi_base, SPI_SS, SPI_SS_ACTIVE_LOW);
        if(direction == SPI_DIRECTION_2LINES_RXONLY) {
            spi_base->CTL |= SPI_CTL_RXONLY_Msk;
        }
    } else {
        // Slave
        // Configure SS as low active.
        spi_base->SSCTL &= ~SPI_SSCTL_SSACTPOL_Msk;
    }

    /* NOTE: M451's/M480's/M2351's SPI_Open() will enable SPI transfer (SPI_CTL_SPIEN_Msk).
     *       We cannot use SPI_CTL_SPIEN_Msk for judgement of spi_active().
     *       Judge with vector instead. */

    if(direction == SPI_DIRECTION_1LINE) {
        spi_base->CTL |= SPI_CTL_HALFDPX_Msk;
    }
}

static void lpspi_format(LPSPI_T *lpspi_base, int bits, int mode, int slave, int msb_first, int direction)
{

    LPSPI_DISABLE_SYNC(lpspi_base);

//	printf("bits: %d \n", bits);
//	printf("mode: %d \n", mode);
//	printf("slave: %d \n", slave);
//	printf("msb_first: %d \n", msb_first);
//	printf("direction: %d \n", direction);

