OpenNuvoton/NuMicroPy/M55M1/hal/M55M1_SPI.c
    LPSPI_Open(lpspi_base,
               slave,
               (mode == 0) ? LPSPI_MODE_0 : (mode == 1) ? LPSPI_MODE_1 : (mode == 2) ? LPSPI_MODE_2 : LPSPI_MODE_3,
               bits,
               0);


    if(msb_first == SPI_FIRSTBIT_MSB)
        LPSPI_SET_MSB_FIRST(lpspi_base);
    else
        LPSPI_SET_LSB_FIRST(lpspi_base);


    if (slave == SPI_MASTER) {
        // Master
        // Configure SS as low active.
        LPSPI_EnableAutoSS(lpspi_base, LPSPI_SS, SPI_SS_ACTIVE_LOW);
        if(direction == SPI_DIRECTION_2LINES_RXONLY) {
            lpspi_base->CTL |= LPSPI_CTL_RXONLY_Msk;
        }
    } else {
        // Slave
        // Configure SS as low active.
        lpspi_base->SSCTL &= ~LPSPI_SSCTL_SSACTPOL_Msk;
    }

    /* NOTE: M451's/M480's/M2351's SPI_Open() will enable SPI transfer (SPI_CTL_SPIEN_Msk).
     *       We cannot use SPI_CTL_SPIEN_Msk for judgement of spi_active().
     *       Judge with vector instead. */

    if(direction == SPI_DIRECTION_1LINE) {
        lpspi_base->CTL |= LPSPI_CTL_HALFDPX_Msk;
    }
}


static void spi_frequency(SPI_T *spi_base, int hz)
{

    SPI_DISABLE_SYNC(spi_base);

    SPI_SetBusClock(spi_base, hz);
}

static void lpspi_frequency(LPSPI_T *lpspi_base, int hz)
{

    LPSPI_DISABLE_SYNC(lpspi_base);

    LPSPI_SetBusClock(lpspi_base, hz);
}

static int spi_readable(SPI_T *spi_base)
{
    return ! SPI_GET_RX_FIFO_EMPTY_FLAG(spi_base);
}

static int lpspi_readable(LPSPI_T *lpspi_base)
{
    return ! LPSPI_GET_RX_FIFO_EMPTY_FLAG(lpspi_base);
}

static int spi_writeable(SPI_T *spi_base)
{
    // Receive FIFO must not be full to avoid receive FIFO overflow on next transmit/receive
    return (! SPI_GET_TX_FIFO_FULL_FLAG(spi_base));
}

static int lpspi_writeable(LPSPI_T *lpspi_base)
{
    // Receive FIFO must not be full to avoid receive FIFO overflow on next transmit/receive
    return (! LPSPI_GET_TX_FIFO_FULL_FLAG(lpspi_base));
}

static uint8_t spi_get_data_width(spi_t *obj)
{
    SPI_T *spi_base = (SPI_T *) obj->u_spi.spi;
    LPSPI_T *lpspi_base = (LPSPI_T *) obj->u_spi.lpspi;
    uint32_t data_width;

    if(obj->bLPSPI)
        data_width = ((lpspi_base->CTL & LPSPI_CTL_DWIDTH_Msk) >> LPSPI_CTL_DWIDTH_Pos);
    else
        data_width = ((spi_base->CTL & SPI_CTL_DWIDTH_Msk) >> SPI_CTL_DWIDTH_Pos);

    if (data_width == 0) {
        data_width = 32;
    }

    return data_width;
}

static void spi_check_dma_usage(spi_t *obj, E_PDMAUsage *dma_usage, int *dma_ch_tx, int *dma_ch_rx)
{
    const struct nu_modinit_s *modinit = get_modinit((uint32_t)obj->u_spi.spi, spi_modinit_tab);
    if(modinit == NULL)
        return;

    struct nu_spi_var *psSpiVar = (struct nu_spi_var *)modinit->var;

    if (*dma_usage != ePDMA_USAGE_NEVER) {
//printf("spi_check_dma_usage 0 \n");
        if (*dma_ch_tx == NU_PDMA_OUT_OF_CHANNELS) {
            if(obj->bLPSPI)
                *dma_ch_tx = nu_lppdma_channel_dynamic_allocate(psSpiVar->pdma_perp_tx);
            else
                *dma_ch_tx = nu_pdma_channel_dynamic_allocate(psSpiVar->pdma_perp_tx);
        }
        if (*dma_ch_rx == NU_PDMA_OUT_OF_CHANNELS) {
            if(obj->bLPSPI)
                *dma_ch_rx = nu_lppdma_channel_dynamic_allocate(psSpiVar->pdma_perp_rx);
            else
                *dma_ch_rx = nu_pdma_channel_dynamic_allocate(psSpiVar->pdma_perp_rx);
        }

        if (*dma_ch_tx == NU_PDMA_OUT_OF_CHANNELS || *dma_ch_rx == NU_PDMA_OUT_OF_CHANNELS) {
            *dma_usage = ePDMA_USAGE_NEVER;
        }
    }

    if (*dma_usage == ePDMA_USAGE_NEVER) {
//printf("spi_check_dma_usage 1 \n");
        if(obj->bLPSPI) {
            if(*dma_ch_tx != NU_PDMA_OUT_OF_CHANNELS)
                nu_lppdma_channel_free(*dma_ch_tx);

            if(*dma_ch_rx != NU_PDMA_OUT_OF_CHANNELS)
                nu_lppdma_channel_free(*dma_ch_rx);
        } else {
            if(*dma_ch_tx != NU_PDMA_OUT_OF_CHANNELS)
                nu_pdma_channel_free(*dma_ch_tx);

            if(*dma_ch_rx != NU_PDMA_OUT_OF_CHANNELS)
                nu_pdma_channel_free(*dma_ch_rx);
        }

        *dma_ch_tx = NU_PDMA_OUT_OF_CHANNELS;
        *dma_ch_rx = NU_PDMA_OUT_OF_CHANNELS;
    }
}

static void spi_enable_event(spi_t *obj, uint32_t event, uint8_t enable)
{
    obj->event &= ~SPI_EVENT_ALL;

    if (event & SPI_EVENT_RX_OVERFLOW) {
        if(obj->bLPSPI)
            LPSPI_EnableInt(obj->u_spi.lpspi, LPSPI_FIFOCTL_RXOVIEN_Msk);
        else
            SPI_EnableInt(obj->u_spi.spi, SPI_FIFOCTL_RXOVIEN_Msk);
    }
}

static void spi_buffer_set(spi_t *obj, const void *tx, size_t tx_length, void *rx, size_t rx_length)
{
    obj->tx_buff.buffer = (void *) tx;
    obj->tx_buff.length = tx_length;
    obj->tx_buff.pos = 0;
    obj->tx_buff.width = spi_get_data_width(obj);
    obj->rx_buff.buffer = rx;
    obj->rx_buff.length = rx_length;
    obj->rx_buff.pos = 0;
    obj->rx_buff.width = spi_get_data_width(obj);
}

static int spi_is_tx_complete(spi_t *obj)
{
    return (obj->tx_buff.pos == obj->tx_buff.length);
}

static int spi_is_rx_complete(spi_t *obj)
{
    return (obj->rx_buff.pos == obj->rx_buff.length);
}

/** Return FIFO depth of the SPI peripheral
 *
 * @details
 *      SPI0/1/2/3/4      8 if data width <=16; 4 otherwise
 */
static uint32_t spi_fifo_depth(spi_t *obj)
{
    return (spi_get_data_width(obj) <= 16) ? 8 : 4;
}


/**
 * Send words from the SPI TX buffer until the send limit is reached or the TX FIFO is full
 * tx_limit is provided to ensure that the number of SPI frames (words) in flight can be managed.
 * @param[in] obj       The SPI object on which to operate
 * @param[in] tx_limit  The maximum number of words to send
 * @return The number of SPI words that have been transfered
 */
static uint32_t spi_master_write_asynch(spi_t *obj, uint32_t tx_limit)
{
    uint32_t n_words = 0;
    uint32_t tx_rmn = obj->tx_buff.length - obj->tx_buff.pos;
    uint32_t rx_rmn = obj->rx_buff.length - obj->rx_buff.pos;
    uint32_t max_tx = NU_MAX(tx_rmn, rx_rmn);
    max_tx = NU_MIN(max_tx, tx_limit);
    uint8_t data_width = spi_get_data_width(obj);
    uint8_t bytes_per_word = (data_width + 7) / 8;
//    uint8_t *tx = (uint8_t *)(obj->tx_buff.buffer) + bytes_per_word * obj->tx_buff.pos;
    uint8_t *tx = (uint8_t *)(obj->tx_buff.buffer) + obj->tx_buff.pos;
    SPI_T *spi_base = (SPI_T *)obj->u_spi.spi;
    LPSPI_T *lpspi_base = (LPSPI_T *)obj->u_spi.lpspi;

    while (n_words < max_tx) {
//    if ((n_words < max_tx)) {
        if((obj->bLPSPI) && (!lpspi_writeable(lpspi_base)))
            break;
        else if(!spi_writeable(spi_base))
            break;

        if (spi_is_tx_complete(obj)) {
            // Transmit dummy as transmit buffer is empty
            if(obj->bLPSPI)
                LPSPI_WRITE_TX(lpspi_base, 0);
            else
                SPI_WRITE_TX(spi_base, 0);

        } else {
            switch (bytes_per_word) {
            case 4:
                if(obj->bLPSPI)
                    LPSPI_WRITE_TX(lpspi_base, nu_get32_le(tx));
                else
                    SPI_WRITE_TX(spi_base, nu_get32_le(tx));
                //printf("DDDDD 0 %x\n", tx);
                tx += 4;
                break;
            case 2:
                if(obj->bLPSPI)
                    LPSPI_WRITE_TX(lpspi_base, nu_get16_le(tx));
                else
                    SPI_WRITE_TX(spi_base, nu_get16_le(tx));
                tx += 2;
                break;
            case 1:
                if(obj->bLPSPI)
                    LPSPI_WRITE_TX(lpspi_base, *((uint8_t *) tx));
                else
                    SPI_WRITE_TX(spi_base, *((uint8_t *) tx));
                tx += 1;
                break;
            }

            obj->tx_buff.pos += bytes_per_word;
        }
        n_words ++;
    }

    //Return the number of words that have been sent
    return n_words;
}


/**
 * Read SPI words out of the RX FIFO
 * Continues reading words out of the RX FIFO until the following condition is met:
 * o There are no more words in the FIFO
 * OR BOTH OF:
 * o At least as many words as the TX buffer have been received
 * o At least as many words as the RX buffer have been received
 * This way, RX overflows are not generated when the TX buffer size exceeds the RX buffer size
 * @param[in] obj The SPI object on which to operate
 * @return Returns the number of words extracted from the RX FIFO
 */
static uint32_t spi_master_read_asynch(spi_t *obj)
{
    uint32_t n_words = 0;
    uint32_t tx_rmn = obj->tx_buff.length - obj->tx_buff.pos;
    uint32_t rx_rmn = obj->rx_buff.length - obj->rx_buff.pos;
    uint32_t max_rx = NU_MAX(tx_rmn, rx_rmn);
    uint8_t data_width = spi_get_data_width(obj);
    uint8_t bytes_per_word = (data_width + 7) / 8;
//    uint8_t *rx = (uint8_t *)(obj->rx_buff.buffer) + bytes_per_word * obj->rx_buff.pos;
    uint8_t *rx = (uint8_t *)(obj->rx_buff.buffer) + obj->rx_buff.pos;
    SPI_T *spi_base = (SPI_T *)obj->u_spi.spi;
    LPSPI_T *lpspi_base = (LPSPI_T *)obj->u_spi.lpspi;

//	printf("DDDDDDD spi_master_read_asynch 1 %d \n", max_rx);

    while (n_words < max_rx) {
//    if ((n_words < max_rx)) {
        if((obj->bLPSPI) && (!lpspi_readable(lpspi_base)))
            break;
        else if(!spi_readable(spi_base))
            break;

