OpenNuvoton/NuMicroPy/M55M1/hal/M55M1_SPI.c
        if (spi_is_rx_complete(obj)) {
            // Disregard as receive buffer is full
            if(obj->bLPSPI)
                LPSPI_READ_RX(lpspi_base);
            else
                SPI_READ_RX(spi_base);
        } else {
            switch (bytes_per_word) {
            case 4: {
                uint32_t val;

                if(obj->bLPSPI)
                    val = LPSPI_READ_RX(lpspi_base);
                else
                    val = SPI_READ_RX(spi_base);

                nu_set32_le(rx, val);
                rx += 4;
                break;
            }
            case 2: {
                uint16_t val;

                if(obj->bLPSPI)
                    val = LPSPI_READ_RX(lpspi_base);
                else
                    val = SPI_READ_RX(spi_base);

                nu_set16_le(rx, val);
                rx += 2;
                break;
            }
            case 1:
                if(obj->bLPSPI)
                    *rx ++ = LPSPI_READ_RX(lpspi_base);
                else
                    *rx ++ = SPI_READ_RX(spi_base);
                break;
            }

            obj->rx_buff.pos += bytes_per_word;
        }
        n_words ++;
    }

    // Return the number of words received
    return n_words;
}


static void spi_enable_vector_interrupt(spi_t *obj, uint32_t handler, uint8_t enable)
{
    const struct nu_modinit_s *modinit = get_modinit((uint32_t)obj->u_spi.spi, spi_modinit_tab);

    if(modinit == NULL)
        return;

    struct nu_spi_var *var = (struct nu_spi_var *) modinit->var;

    if (enable) {
        var->obj = obj;
        obj->hdlr_async = handler;
        /* Fixed vector table is fixed in ROM and cannot be modified. */
        NVIC_EnableIRQ(modinit->irq_n);
    } else {
        NVIC_DisableIRQ(modinit->irq_n);
        /* Fixed vector table is fixed in ROM and cannot be modified. */
        var->obj = NULL;
        obj->hdlr_async = 0;
    }
}

static void spi_master_enable_interrupt(spi_t *obj, uint8_t enable)
{
    SPI_T *spi_base = (SPI_T *) obj->u_spi.spi;
    LPSPI_T *lpspi_base = (LPSPI_T *) obj->u_spi.lpspi;

    if(obj->bLPSPI) {
        if (enable) {
            uint32_t fifo_depth = spi_fifo_depth(obj);
            LPSPI_SetFIFO(lpspi_base, fifo_depth / 2, fifo_depth / 2);
            // Enable tx/rx FIFO threshold interrupt
            LPSPI_EnableInt(lpspi_base, LPSPI_FIFO_RXTH_INT_MASK | LPSPI_FIFO_TXTH_INT_MASK);
        } else {
            LPSPI_DisableInt(lpspi_base, LPSPI_FIFO_RXTH_INT_MASK | LPSPI_FIFO_TXTH_INT_MASK);
        }

        return;
    }

    if (enable) {
        uint32_t fifo_depth = spi_fifo_depth(obj);
        SPI_SetFIFO(spi_base, (fifo_depth / 2), (fifo_depth / 2));
        // Enable tx/rx FIFO threshold interrupt
        SPI_EnableInt(spi_base, SPI_FIFO_RXTH_INT_MASK | SPI_FIFO_TXTH_INT_MASK);
    } else {
        SPI_DisableInt(spi_base, SPI_FIFO_RXTH_INT_MASK | SPI_FIFO_TXTH_INT_MASK);
    }
}

static void spi_dma_handler_tx(void* id, uint32_t event_dma)
{
    spi_t *obj = (spi_t *) id;

    // TODO: Pass this error to caller
    if (event_dma & NU_PDMA_EVENT_ABORT) {
        printf("spi_dma_handler_tx 0 \n");
    }
    // Expect SPI IRQ will catch this transfer done event
    if (event_dma & NU_PDMA_EVENT_TRANSFER_DONE) {
        obj->tx_buff.pos = obj->tx_buff.length;
//		printf("spi_dma_handler_tx 1 \n");
    }
    // TODO: Pass this error to caller
    if (event_dma & NU_PDMA_EVENT_TIMEOUT) {
        printf("spi_dma_handler_tx 2 \n");
    }

    const struct nu_modinit_s *modinit = get_modinit((uint32_t)obj->u_spi.spi, spi_modinit_tab);
    if(modinit == NULL)
        return;

    if (obj && obj->hdlr_async) {
        void (*hdlr_async)(spi_t *) = (void(*)(spi_t *))(obj->hdlr_async);
        hdlr_async(obj);
    }
}

static void spi_dma_handler_rx(void* id, uint32_t event_dma)
{
    spi_t *obj = (spi_t *) id;

    // TODO: Pass this error to caller
    if (event_dma & NU_PDMA_EVENT_ABORT) {
        printf("spi_dma_handler_rx 0 \n");
    }
    // Expect SPI IRQ will catch this transfer done event
    if (event_dma & NU_PDMA_EVENT_TRANSFER_DONE) {
        obj->rx_buff.pos = obj->rx_buff.length;
    }
    // TODO: Pass this error to caller
    if (event_dma & NU_PDMA_EVENT_TIMEOUT) {
        printf("spi_dma_handler_rx 2 \n");
    }

    const struct nu_modinit_s *modinit = get_modinit((uint32_t)obj->u_spi.spi, spi_modinit_tab);
    if(modinit == NULL)
        return;

    if (obj && obj->hdlr_async) {
        void (*hdlr_async)(spi_t *) = (void(*)(spi_t *))(obj->hdlr_async);
        hdlr_async(obj);
    }

}

/**
 * Abort an SPI transfer
 * This is a helper function for event handling. When any of the events listed occurs, the HAL will abort any ongoing
 * transfers
 * @param[in] obj The SPI peripheral to stop
 */
static void spi_abort_asynch(spi_t *obj)
{
    SPI_T *spi_base = (SPI_T *) obj->u_spi.spi;
    LPSPI_T *lpspi_base = (LPSPI_T *) obj->u_spi.lpspi;

    printf("DDDDDDD spi_abort_asynch \n");
    if (obj->dma_usage != ePDMA_USAGE_NEVER) {
        // Receive FIFO Overrun in case of tx length > rx length on DMA way
        if(obj->bLPSPI) {
            if (lpspi_base->STATUS & LPSPI_STATUS_RXOVIF_Msk) {
                lpspi_base->STATUS = LPSPI_STATUS_RXOVIF_Msk;
            }

            if (obj->dma_chn_id_tx != NU_PDMA_OUT_OF_CHANNELS) {
                nu_lppdma_channel_terminate(obj->dma_chn_id_tx);
            }
            LPSPI_DISABLE_TX_PDMA(lpspi_base);

            if (obj->dma_chn_id_rx != NU_PDMA_OUT_OF_CHANNELS) {
                nu_lppdma_channel_terminate(obj->dma_chn_id_rx);
            }

            LPSPI_DISABLE_RX_PDMA(lpspi_base);
        } else {
            if (spi_base->STATUS & SPI_STATUS_RXOVIF_Msk) {
                spi_base->STATUS = SPI_STATUS_RXOVIF_Msk;
            }

            if (obj->dma_chn_id_tx != NU_PDMA_OUT_OF_CHANNELS) {
                nu_pdma_channel_terminate(obj->dma_chn_id_tx);
            }
            SPI_DISABLE_TX_PDMA(spi_base);

            if (obj->dma_chn_id_rx != NU_PDMA_OUT_OF_CHANNELS) {
                nu_pdma_channel_terminate(obj->dma_chn_id_rx);
            }

            SPI_DISABLE_RX_PDMA(spi_base);
        }
    }

