OpenNuvoton/NuMicroPy/M55M1/hal/M55M1_SPI.c
    // Necessary for both interrupt way and DMA way
    spi_enable_vector_interrupt(obj, 0, 0);
    spi_master_enable_interrupt(obj, 0);

    /* Necessary for accessing FIFOCTL below */
    if(obj->bLPSPI) {
        LPSPI_DISABLE_SYNC(lpspi_base);

        LPSPI_ClearRxFIFO(lpspi_base);
        LPSPI_ClearTxFIFO(lpspi_base);
    } else {
        SPI_DISABLE_SYNC(spi_base);

        SPI_ClearRxFIFO(spi_base);
        SPI_ClearTxFIFO(spi_base);
    }
}

static uint32_t spi_event_check(spi_t *obj)
{
    SPI_T *spi_base = (SPI_T *) obj->u_spi.spi;
    LPSPI_T *lpspi_base = (LPSPI_T *) obj->u_spi.lpspi;
    uint32_t event = 0;
//	uint32_t u32Status = 0;

//	u32Status = spi_base->STATUS;

    if (obj->dma_usage == ePDMA_USAGE_NEVER) {
        uint32_t n_rec = spi_master_read_asynch(obj);
        spi_master_write_asynch(obj, n_rec);
    }

    if(spi_is_tx_complete(obj)) {
        if(obj->bLPSPI) {
            LPSPI_ClearIntFlag(lpspi_base, LPSPI_TXUF_INT_MASK);
            LPSPI_DisableInt(lpspi_base, LPSPI_FIFO_TXTH_INT_MASK);
        } else {
            SPI_ClearIntFlag(spi_base, SPI_TXUF_INT_MASK);
            SPI_DisableInt(spi_base, SPI_FIFO_TXTH_INT_MASK);
        }
    }

    if(spi_is_rx_complete(obj)) {
        if(obj->bLPSPI) {
            LPSPI_ClearIntFlag(lpspi_base, LPSPI_FIFO_RXOV_INT_MASK);
            LPSPI_DisableInt(lpspi_base, LPSPI_FIFO_RXTH_INT_MASK);
        } else {
            SPI_ClearIntFlag(spi_base, SPI_FIFO_RXOV_INT_MASK);
            SPI_DisableInt(spi_base, SPI_FIFO_RXTH_INT_MASK);
        }
    }

    if (spi_is_tx_complete(obj) && spi_is_rx_complete(obj)) {
//		printf("DDDDDDD spi_event_check  complete %x \n", u32Status);
        spi_master_enable_interrupt(obj, 0);
        event |= SPI_EVENT_COMPLETE;
    }

    if(obj->bLPSPI) {
        // Receive FIFO Overrun
        if (lpspi_base->STATUS & LPSPI_STATUS_RXOVIF_Msk) {
            lpspi_base->STATUS = LPSPI_STATUS_RXOVIF_Msk;
            printf("spi_event_check error 0 \n");
            // In case of tx length > rx length on DMA way
            if (obj->dma_usage == ePDMA_USAGE_NEVER) {
                event |= SPI_EVENT_RX_OVERFLOW;
            }
        }

        // Receive Time-Out
        if (lpspi_base->STATUS & LPSPI_STATUS_RXTOIF_Msk) {
            lpspi_base->STATUS = LPSPI_STATUS_RXTOIF_Msk;
            // Not using this IF. Just clear it.
            printf("spi_event_check error 1 \n");
        }
        // Transmit FIFO Under-Run
        if (lpspi_base->STATUS & LPSPI_STATUS_TXUFIF_Msk) {
            lpspi_base->STATUS = LPSPI_STATUS_TXUFIF_Msk;
            event |= SPI_EVENT_ERROR;
            printf("spi_event_check error 2 \n");
        }

        return event;
    }

    // Receive FIFO Overrun
    if (spi_base->STATUS & SPI_STATUS_RXOVIF_Msk) {
        spi_base->STATUS = SPI_STATUS_RXOVIF_Msk;
        printf("spi_event_check error 0 \n");
        // In case of tx length > rx length on DMA way
        if (obj->dma_usage == ePDMA_USAGE_NEVER) {
            event |= SPI_EVENT_RX_OVERFLOW;
        }
    }

    // Receive Time-Out
    if (spi_base->STATUS & SPI_STATUS_RXTOIF_Msk) {
        spi_base->STATUS = SPI_STATUS_RXTOIF_Msk;
        // Not using this IF. Just clear it.
        printf("spi_event_check error 1 \n");
    }

    // Transmit FIFO Under-Run
    if (spi_base->STATUS & SPI_STATUS_TXUFIF_Msk) {
        spi_base->STATUS = SPI_STATUS_TXUFIF_Msk;
        event |= SPI_EVENT_ERROR;
        printf("spi_event_check error 2 \n");
    }

    return event;
}


int is_spi_trans_done(spi_t *obj)
{
    if (spi_is_tx_complete(obj) && spi_is_rx_complete(obj)) {
        return 1;
    }
    return 0;
}

int32_t SPI_Init(
    spi_t *obj,
    SPI_InitTypeDef *psInitDef
)
{
    const struct nu_modinit_s *modinit = get_modinit((uint32_t)obj->u_spi.spi, spi_modinit_tab);

    if(modinit == NULL)
        return -1;

    // Reset this module
    SYS_ResetModule(modinit->rsetidx);

    // Select IP clock source
    CLK_SetModuleClock(modinit->clkidx, modinit->clksrc, modinit->clkdiv);
    // Enable IP clock
    CLK_EnableModuleClock(modinit->clkidx);


#if DEVICE_SPI_ASYNCH
    obj->dma_usage = ePDMA_USAGE_NEVER;
    obj->event = 0;
    obj->hdlr_async = 0;
    obj->dma_chn_id_tx = NU_PDMA_OUT_OF_CHANNELS;
    obj->dma_chn_id_rx = NU_PDMA_OUT_OF_CHANNELS;

#endif

    int mode =0;
    if(psInitDef->ClockPolarity == 0) {
        if(psInitDef->ClockPhase == SPI_PHASE_1EDGE)
            mode = 0;
        else
            mode = 1;
    } else {
        if(psInitDef->ClockPhase == SPI_PHASE_1EDGE)
            mode = 3;
        else
            mode = 2;
    }

    if(obj->bLPSPI) {
        lpspi_format(obj->u_spi.lpspi, psInitDef->Bits, mode, psInitDef->Mode, psInitDef->FirstBit, psInitDef->Direction);

        if(psInitDef->Mode == SPI_MASTER)
            lpspi_frequency(obj->u_spi.lpspi, psInitDef->BaudRate);
    } else {
        spi_format(obj->u_spi.spi, psInitDef->Bits, mode, psInitDef->Mode, psInitDef->FirstBit, psInitDef->Direction);

        if(psInitDef->Mode == SPI_MASTER)
            spi_frequency(obj->u_spi.spi, psInitDef->BaudRate);
    }

    return 0;
}

void SPI_Final(spi_t *obj)
{
#if DEVICE_SPI_ASYNCH
    if (obj->dma_chn_id_tx != NU_PDMA_OUT_OF_CHANNELS) {
        nu_pdma_channel_free(obj->dma_chn_id_tx);
        obj->dma_chn_id_tx = NU_PDMA_OUT_OF_CHANNELS;
    }
    if (obj->dma_chn_id_rx != NU_PDMA_OUT_OF_CHANNELS) {
        nu_pdma_channel_free(obj->dma_chn_id_rx);
        obj->dma_chn_id_rx = NU_PDMA_OUT_OF_CHANNELS;
    }
#endif

    if(obj->bLPSPI)
        LPSPI_Close(obj->u_spi.lpspi);
    else
        SPI_Close(obj->u_spi.spi);

    const struct nu_modinit_s *modinit = get_modinit((uint32_t)obj->u_spi.spi, spi_modinit_tab);
    if(modinit == NULL)
        return;
    if(modinit->modname != (int) obj->u_spi.spi)
        return;


    if(obj->bLPSPI)
        LPSPI_DisableInt((obj->u_spi.lpspi), (LPSPI_FIFO_RXOV_INT_MASK | LPSPI_FIFO_RXTH_INT_MASK | LPSPI_FIFO_TXTH_INT_MASK));
    else
        SPI_DisableInt((obj->u_spi.spi), (SPI_FIFO_RXOV_INT_MASK | SPI_FIFO_RXTH_INT_MASK | SPI_FIFO_TXTH_INT_MASK));

    NVIC_DisableIRQ(modinit->irq_n);

