OpenNuvoton/NuMicroPy/M55M1/hal/M55M1_SPI.c
    // Disable IP clock
    CLK_DisableModuleClock(modinit->clkidx);
}


int SPI_SetDataWidth(
    spi_t *obj,
    int data_width_bits
)
{

    if((data_width_bits != 8) && (data_width_bits != 16) && (data_width_bits != 32))
        return -1;

    if(obj->bLPSPI)
        LPSPI_SET_DATA_WIDTH(obj->u_spi.lpspi, data_width_bits);
    else
        SPI_SET_DATA_WIDTH(obj->u_spi.spi, data_width_bits);

    return 0;
}


int SPI_MasterReadOnly(spi_t *obj)
{
    SPI_T *spi_base = (SPI_T *) obj->u_spi.spi;
    LPSPI_T *lpspi_base = (LPSPI_T *) obj->u_spi.lpspi;
    int value;

    if(obj->bLPSPI) {
        // NOTE: Data in receive FIFO can be read out via ICE.
        LPSPI_ENABLE_SYNC(lpspi_base);

        // Wait for rx buffer full
        while (! lpspi_readable(lpspi_base)) {
            MICROPY_THREAD_YIELD();
        }

        value = LPSPI_READ_RX(lpspi_base);

        return value;
    }


    // NOTE: Data in receive FIFO can be read out via ICE.
    SPI_ENABLE_SYNC(spi_base);

    // Wait for rx buffer full
    while (! spi_readable(spi_base)) {
        MICROPY_THREAD_YIELD();
    }

    value = SPI_READ_RX(spi_base);

    /* We don't call SPI_DISABLE_SYNC here for performance. */

    return value;
}

int SPI_MasterWrite(spi_t *obj, int value)
{
    SPI_T *spi_base = (SPI_T *) obj->u_spi.spi;
    LPSPI_T *lpspi_base = (LPSPI_T *) obj->u_spi.lpspi;
    int value2;

    if(obj->bLPSPI) {
        // NOTE: Data in receive FIFO can be read out via ICE.
        LPSPI_ENABLE_SYNC(lpspi_base);

        // Wait for tx buffer empty
        while(! lpspi_writeable(lpspi_base)) {
            MICROPY_THREAD_YIELD();
        }
        LPSPI_WRITE_TX(lpspi_base, value);

        // Wait for rx buffer full
        while (! lpspi_readable(lpspi_base)) {
            MICROPY_THREAD_YIELD();
        }

        value2 = LPSPI_READ_RX(lpspi_base);

        return value2;
    }

    // NOTE: Data in receive FIFO can be read out via ICE.
    SPI_ENABLE_SYNC(spi_base);

    // Wait for tx buffer empty
    while(! spi_writeable(spi_base)) {
        MICROPY_THREAD_YIELD();
    }
    SPI_WRITE_TX(spi_base, value);

    // Wait for rx buffer full
    while (! spi_readable(spi_base)) {
        MICROPY_THREAD_YIELD();
    }
    value2 = SPI_READ_RX(spi_base);

    /* We don't call SPI_DISABLE_SYNC here for performance. */

    return value2;
}

int SPI_MasterBlockWriteRead(spi_t *obj, const char *tx_buffer, int tx_length,
                             char *rx_buffer, int rx_length, char write_fill)
{
    int total = (tx_length > rx_length) ? tx_length : rx_length;

    //for testing
//	int j;
//	char *buf = (char *)tx_buffer;
//	for(j = 0; j < tx_length; j++){
//		buf[j] = j;
//	}

    uint8_t data_width = spi_get_data_width(obj);
    uint8_t bytes_per_word = (data_width + 7) / 8;
    int32_t in = 0;
    uint8_t *tx = (uint8_t *)tx_buffer;
    uint8_t *rx = (uint8_t *)rx_buffer;
    int i = 0;
    int32_t fill = 0;

    if(bytes_per_word == 4)
        fill = (write_fill << 24) | (write_fill << 16) | (write_fill << 8) | write_fill;
    else if(bytes_per_word == 2)
        fill = (write_fill << 8) | write_fill;
    else
        fill = write_fill;

    while(i < total) {
        if (i > tx_length) {
            in = SPI_MasterWrite(obj, fill);
        } else {
            switch (bytes_per_word) {
            case 4:
                in = SPI_MasterWrite(obj, nu_get32_le(tx));
                tx += 4;
                break;
            case 2:
                in = SPI_MasterWrite(obj, nu_get16_le(tx));
                tx += 2;
                break;
            case 1:
                in = SPI_MasterWrite(obj, *((uint8_t *) tx));
                tx += 1;
                break;
            }
        }


        if((rx) && (i <= rx_length)) {
            switch (bytes_per_word) {
            case 4:
                nu_set32_le(rx, in);
                rx += 4;
                break;
            case 2:
                nu_set16_le(rx, in);
                rx += 2;
                break;
            case 1:
                *rx ++ = (uint8_t) in;
                break;
            }
        }

        i += bytes_per_word;
    }


    //for testing
//	buf = (char *)rx_buffer;
//	for(j = 0; j < rx_length; j++){
//		printf("[%x]", buf[j]);
//	}
//	printf("\n");

    return total;
}

int SPI_MasterWriteThenRead(spi_t *obj, const char *tx_buffer, int tx_length,
                            char *rx_buffer, int rx_length, char write_fill)
{

    uint8_t data_width = spi_get_data_width(obj);
    uint8_t bytes_per_word = (data_width + 7) / 8;
    int32_t in = 0;
    uint8_t *tx = (uint8_t *)tx_buffer;
    uint8_t *rx = (uint8_t *)rx_buffer;
    int i = 0;
    int32_t fill = 0;

    if(bytes_per_word == 4)
        fill = (write_fill << 24) | (write_fill << 16) | (write_fill << 8) | write_fill;
    else if(bytes_per_word == 2)
        fill = (write_fill << 8) | write_fill;
    else
        fill = write_fill;

    while(i < tx_length) {
        switch (bytes_per_word) {
        case 4:
            in = SPI_MasterWrite(obj, nu_get32_le(tx));
            tx += 4;
            break;
        case 2:
            in = SPI_MasterWrite(obj, nu_get16_le(tx));
            tx += 2;
            break;
        case 1:
            in = SPI_MasterWrite(obj, *((uint8_t *) tx));
            tx += 1;
            break;
        }

        i += bytes_per_word;
    }

    i = 0;

    while(i < rx_length) {

        in = SPI_MasterWrite(obj, fill);
        printf("in is %lx \n", in);

        switch (bytes_per_word) {
        case 4:
            nu_set32_le(rx, in);
            rx += 4;
            break;
        case 2:
            nu_set16_le(rx, in);
            rx += 2;
            break;
        case 1:
            *rx ++ = (uint8_t) in;
            break;
        }

        i += bytes_per_word;
    }

    return rx_length;
}

#if DEVICE_SPISLAVE

int SPI_SlaveReceive(spi_t *obj)
{
    SPI_T *spi_base = (SPI_T *)obj->u_spi.spi;
    LPSPI_T *lpspi_base = (LPSPI_T *)obj->u_spi.lpspi;

    if(obj->bLPSPI) {
        LPSPI_ENABLE_SYNC(lpspi_base);
        return lpspi_readable(lpspi_base);
    }

