OpenNuvoton/NuMicroPy/M55M1/hal/M55M1_SPI.c
    SPI_ENABLE_SYNC(spi_base);
    return spi_readable(spi_base);
};

int SPI_SlaveReadOnly(spi_t *obj)
{
    SPI_T *spi_base = (SPI_T *)obj->u_spi.spi;
    LPSPI_T *lpspi_base = (LPSPI_T *)obj->u_spi.lpspi;
    int value;

    if(obj->bLPSPI) {
        LPSPI_ENABLE_SYNC(lpspi_base);

        // Wait for rx buffer full
        while (! lpspi_readable(lpspi_base)) {
            MICROPY_THREAD_YIELD();
        }
        value = LPSPI_READ_RX(lpspi_base);
    }

    SPI_ENABLE_SYNC(spi_base);

    // Wait for rx buffer full
    while (! spi_readable(spi_base)) {
        MICROPY_THREAD_YIELD();
    }

    value = SPI_READ_RX(spi_base);
    return value;
}


int SPI_SlaveWrite(spi_t *obj, int value)
{
    SPI_T *spi_base = (SPI_T *)obj->u_spi.spi;
    LPSPI_T *lpspi_base = (LPSPI_T *)obj->u_spi.lpspi;
    int value2;

    if(obj->bLPSPI) {
        LPSPI_ENABLE_SYNC(lpspi_base);

        // Wait for tx buffer empty
        while(! lpspi_writeable(lpspi_base)) {
            MICROPY_THREAD_YIELD();
        }

        LPSPI_WRITE_TX(lpspi_base, value);

        // Wait for rx buffer full
        while (! lpspi_readable(lpspi_base)) {
            MICROPY_THREAD_YIELD();
        }

        value2 = LPSPI_READ_RX(lpspi_base);
        return value2;
    }

    SPI_ENABLE_SYNC(spi_base);

    // Wait for tx buffer empty
    while(! spi_writeable(spi_base)) {
        MICROPY_THREAD_YIELD();
    }

    SPI_WRITE_TX(spi_base, value);

    // Wait for rx buffer full
    while (! spi_readable(spi_base)) {
        MICROPY_THREAD_YIELD();
    }
    value2 = SPI_READ_RX(spi_base);

    /* We don't call SPI_DISABLE_SYNC here for performance. */

    return value2;
}


int SPI_SlaveBlockWriteRead(spi_t *obj, const char *tx_buffer, int tx_length,
                            char *rx_buffer, int rx_length, char write_fill)
{
    int total = (tx_length > rx_length) ? tx_length : rx_length;

    uint8_t data_width = spi_get_data_width(obj);
    uint8_t bytes_per_word = (data_width + 7) / 8;
    int32_t in = 0;
    uint8_t *tx = (uint8_t *)tx_buffer;
    uint8_t *rx = (uint8_t *)rx_buffer;
    int i = 0;
    int32_t fill = 0;

    if(bytes_per_word == 4)
        fill = (write_fill << 24) | (write_fill << 16) | (write_fill << 8) | write_fill;
    else if(bytes_per_word == 2)
        fill = (write_fill << 8) | write_fill;
    else
        fill = write_fill;

    while(i < total) {
        if (i > tx_length) {
            in = SPI_MasterWrite(obj, fill);
        } else {
            switch (bytes_per_word) {
            case 4:
                in = SPI_MasterWrite(obj, nu_get32_le(tx));
                tx += 4;
                break;
            case 2:
                in = SPI_MasterWrite(obj, nu_get16_le(tx));
                tx += 2;
                break;
            case 1:
                in = SPI_MasterWrite(obj, *((uint8_t *) tx));
                tx += 1;
                break;
            }
        }


        if(i <= rx_length) {
            switch (bytes_per_word) {
            case 4:
                nu_set32_le(rx, in);
                rx += 4;
                break;
            case 2:
                nu_set16_le(rx, in);
                rx += 2;
                break;
            case 1:
                *rx ++ = (uint8_t) in;
                break;
            }
        }

        i += bytes_per_word;
    }

    return total;
}


#endif

#if DEVICE_SPI_ASYNCH
void spi_master_transfer(
    spi_t *obj,
    const void *tx,
    size_t tx_length,
    void *rx,
    size_t rx_length,
    uint8_t bit_width,
    uint32_t handler,
    uint32_t event,
    E_PDMAUsage hint
)
{
    SPI_T *spi_base = (SPI_T *) obj->u_spi.spi;
    LPSPI_T *lpspi_base = (LPSPI_T *) obj->u_spi.lpspi;

    if(obj->bLPSPI)
        LPSPI_SET_DATA_WIDTH(lpspi_base, bit_width);
    else
        SPI_SET_DATA_WIDTH(spi_base, bit_width);

    obj->dma_usage = hint;

    spi_check_dma_usage(obj, (E_PDMAUsage *)&obj->dma_usage, &obj->dma_chn_id_tx, &obj->dma_chn_id_rx);
    uint32_t data_width = spi_get_data_width(obj);

    // Conditions to go DMA way:
    // (1) No DMA support for non-8 multiple data width.
    // (2) tx length >= rx length. Otherwise, as tx DMA is done, no bus activity for remaining rx.
    if ((data_width % 8) ||
        (tx_length < rx_length)) {

        if(obj->bLPSPI) {
            nu_lppdma_channel_free(obj->dma_chn_id_tx);
            nu_lppdma_channel_free(obj->dma_chn_id_rx);
        } else {
            nu_pdma_channel_free(obj->dma_chn_id_tx);
            nu_pdma_channel_free(obj->dma_chn_id_rx);
        }
        obj->dma_usage = ePDMA_USAGE_NEVER;
        obj->dma_chn_id_tx = NU_PDMA_OUT_OF_CHANNELS;
        obj->dma_chn_id_rx = NU_PDMA_OUT_OF_CHANNELS;
    }

    // SPI IRQ is necessary for both interrupt way and DMA way
    spi_enable_event(obj, event, 1);
    spi_buffer_set(obj, tx, tx_length, rx, rx_length);


    if(obj->bLPSPI)
        LPSPI_ENABLE_SYNC(lpspi_base);
    else
        SPI_ENABLE_SYNC(spi_base);

    if (obj->dma_usage == ePDMA_USAGE_NEVER) {
        // Interrupt way
        if(obj->bLPSPI) {
            LPSPI_ClearRxFIFO(lpspi_base);
            LPSPI_ClearTxFIFO(lpspi_base);
        } else {
            SPI_ClearRxFIFO(spi_base);
            SPI_ClearTxFIFO(spi_base);
        }

        spi_master_write_asynch(obj, spi_fifo_depth(obj));
        spi_master_enable_interrupt(obj, 1);
        spi_enable_vector_interrupt(obj, handler, 1);
    } else {
        // DMA way
        int ret = 0;
        const struct nu_modinit_s *modinit = get_modinit((uint32_t)obj->u_spi.spi, spi_modinit_tab);
        if(modinit == NULL)
            return;

        if(obj->bLPSPI)
            lpspi_base->PDMACTL &= ~(LPSPI_PDMACTL_TXPDMAEN_Msk | LPSPI_PDMACTL_RXPDMAEN_Msk);
        else
            spi_base->PDMACTL &= ~(SPI_PDMACTL_TXPDMAEN_Msk | SPI_PDMACTL_RXPDMAEN_Msk);

        if(tx_length) {
            if(data_width == 16) {
                tx_length = tx_length / 2;
            } else if(data_width == 32) {
                tx_length = tx_length / 4;
            }

            struct nu_pdma_chn_cb pdma_tx_chn_cb;

