OpenNuvoton/NuMicroPy/M55M1/hal/M55M1_SPI.c
            pdma_tx_chn_cb.m_eCBType = eCBType_Event;
            pdma_tx_chn_cb.m_pfnCBHandler = spi_dma_handler_tx;
            pdma_tx_chn_cb.m_pvUserData = obj;

            if(obj->bLPSPI) {
                nu_lppdma_filtering_set(obj->dma_chn_id_tx, NU_PDMA_EVENT_TRANSFER_DONE | NU_PDMA_EVENT_TIMEOUT);
                nu_lppdma_callback_register(obj->dma_chn_id_tx, &pdma_tx_chn_cb);
                ret = nu_lppdma_transfer( obj->dma_chn_id_tx,
                                          data_width,
                                          (uint32_t)tx,
                                          (uint32_t)&lpspi_base->TX,
                                          tx_length,
                                          0
                                        );

            } else {
                nu_pdma_filtering_set(obj->dma_chn_id_tx, NU_PDMA_EVENT_TRANSFER_DONE | NU_PDMA_EVENT_TIMEOUT);
                nu_pdma_callback_register(obj->dma_chn_id_tx, &pdma_tx_chn_cb);
                ret = nu_pdma_transfer( obj->dma_chn_id_tx,
                                        data_width,
                                        (uint32_t)tx,
                                        (uint32_t)&spi_base->TX,
                                        tx_length,
                                        0
                                      );
            }

        }

        if(ret != 0 ) {
            printf("Error: Unable setup SPI TX PDMA transfer %d \n", ret);
            return;
        }

        if(rx_length) {
            if(data_width == 16) {
                rx_length = rx_length / 2;
            } else if(data_width == 32) {
                rx_length = rx_length / 4;
            }

            struct nu_pdma_chn_cb pdma_rx_chn_cb;

            pdma_rx_chn_cb.m_eCBType = eCBType_Event;
            pdma_rx_chn_cb.m_pfnCBHandler = spi_dma_handler_rx;
            pdma_rx_chn_cb.m_pvUserData = obj;

            if(obj->bLPSPI) {
                nu_lppdma_filtering_set(obj->dma_chn_id_rx, NU_PDMA_EVENT_TRANSFER_DONE | NU_PDMA_EVENT_TIMEOUT);
                nu_lppdma_callback_register(obj->dma_chn_id_rx, &pdma_rx_chn_cb);
                ret = nu_lppdma_transfer( obj->dma_chn_id_rx,
                                          data_width,
                                          (uint32_t)&lpspi_base->RX,
                                          (uint32_t)rx,
                                          rx_length,
                                          0
                                        );

            } else {
                nu_pdma_filtering_set(obj->dma_chn_id_rx, NU_PDMA_EVENT_TRANSFER_DONE | NU_PDMA_EVENT_TIMEOUT);
                nu_pdma_callback_register(obj->dma_chn_id_rx, &pdma_rx_chn_cb);
                ret = nu_pdma_transfer( obj->dma_chn_id_rx,
                                        data_width,
                                        (uint32_t)&spi_base->RX,
                                        (uint32_t)rx,
                                        rx_length,
                                        0
                                      );
            }

        }

        if(ret != 0 ) {
            printf("Error: Unable setup SPI RX PDMA transfer %d \n", ret);
            return;
        }

        /* Start tx/rx DMA transfer
         *
         * If we have both PDMA and SPI interrupts enabled and PDMA priority is lower than SPI priority,
         * we would trap in SPI interrupt handler endlessly with the sequence:
         *
         * 1. PDMA TX transfer done interrupt occurs and is well handled.
         * 2. SPI RX FIFO threshold interrupt occurs. Trap here because PDMA RX transfer done interrupt doesn't get handled.
         * 3. PDMA RX transfer done interrupt occurs but it cannot be handled due to above.
         *
         * To fix it, we don't enable SPI TX/RX threshold interrupts but keep SPI vector handler set to be called
         * in PDMA TX/RX transfer done interrupt handlers (spi_dma_handler_tx/spi_dma_handler_rx).
         */
        spi_enable_vector_interrupt(obj, handler, 1);
        /* No TX/RX FIFO threshold interrupt */
        spi_master_enable_interrupt(obj, 0);

        /* Order to enable PDMA TX/RX functions
         *
         * H/W spec: In SPI Master mode with full duplex transfer, if both TX and RX PDMA functions are
         *           enabled, RX PDMA function cannot be enabled prior to TX PDMA function. User can enable
         *           TX PDMA function firstly or enable both functions simultaneously.
         * Per real test, it is safer to start RX PDMA first and then TX PDMA. Otherwise, receive FIFO is
         * subject to overflow by TX DMA.
         *
         * With the above conflicts, we enable PDMA TX/RX functions simultaneously.
         */

        if(tx_length && rx_length) {
            if(obj->bLPSPI)
                LPSPI_TRIGGER_TX_RX_PDMA(lpspi_base);
            else
                SPI_TRIGGER_TX_RX_PDMA(spi_base);
        } else {
            if(obj->bLPSPI) {
                if(tx_length)
                    LPSPI_TRIGGER_TX_PDMA(lpspi_base);

                if(rx_length)
                    LPSPI_TRIGGER_RX_PDMA(lpspi_base);
            } else {

                if(tx_length)
                    SPI_TRIGGER_TX_PDMA(spi_base);

                if(rx_length)
                    SPI_TRIGGER_RX_PDMA(spi_base);
            }
        }
    }

}

#endif

/**
 * Handle the SPI interrupt
 * Read frames until the RX FIFO is empty.  Write at most as many frames as were read.  This way,
 * it is unlikely that the RX FIFO will overflow.
 * @param[in] obj The SPI peripheral that generated the interrupt
 * @return
 */
void spi_irq_handler_asynch(spi_t *obj)
{
    // Check for SPI events
    uint32_t event = spi_event_check(obj);

    if (event & ~SPI_EVENT_COMPLETE) {
        spi_abort_asynch(obj);
    }

    obj->event = event | ((event & SPI_EVENT_COMPLETE) ? SPI_EVENT_INTERNAL_TRANSFER_COMPLETE : 0);
}

/**
 * Handle the SPI interrupt
 * Read frames until the RX FIFO is empty.  Write at most as many frames as were read.  This way,
 * it is unlikely that the RX FIFO will overflow.
 * @param[in] obj The SPI peripheral that generated the interrupt
 * @return
 */

void Handle_SPI_Irq(SPI_T *spi)
{
    spi_t *obj = NULL;
    if(spi == SPI0)
        obj = spi0_var.obj;
    else if(spi == SPI1)
        obj = spi1_var.obj;
    else if(spi == SPI2)
        obj = spi2_var.obj;
    else if(spi == SPI3)
        obj = spi3_var.obj;

    if (obj && obj->hdlr_async) {
        void (*hdlr_async)(spi_t *) = (void(*)(spi_t *))(obj->hdlr_async);
        hdlr_async(obj);
    }
}

/**
 * Handle the LPSPI interrupt
 * Read frames until the RX FIFO is empty.  Write at most as many frames as were read.  This way,
 * it is unlikely that the RX FIFO will overflow.
 * @param[in] obj The SPI peripheral that generated the interrupt
 * @return
 */

void Handle_LPSPI_Irq(LPSPI_T *lpspi)
{
    spi_t *obj = NULL;

    if(lpspi == LPSPI0)
        obj = spi4_var.obj;

    if (obj && obj->hdlr_async) {
        void (*hdlr_async)(spi_t *) = (void(*)(spi_t *))(obj->hdlr_async);
        hdlr_async(obj);
    }
}

